# A191 Stock Factors 161-180

In [3]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [4]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 161

Formula:

`MEAN(MAX(MAX((HIGH-LOW),ABS(DELAY(CLOSE,1)-HIGH)),ABS(DELAY(CLOSE,1)-LOW)),12)`

In [5]:
sql_alpha_161 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(greatest(greatest((high - low),
                             abs(m_lag(close, 1) - high)),
                  abs(m_lag(close, 1) - low)), 12)
    AS alpha_a191_f0161
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_161), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0161
60821   2023-01-19  000001.SZ         45.859325
60822   2023-01-19  000002.SZ         99.085772
60823   2023-01-19  000004.SZ          0.917755
60824   2023-01-19  000005.SZ          0.494272
60825   2023-01-19  000006.SZ          7.463413
...            ...        ...               ...
3858340 2025-12-26  688799.SH          2.368030
3858341 2025-12-26  688800.SH          8.655667
3858345 2025-12-26  688819.SH          0.870262
3858346 2025-12-26  688981.SH          3.964167
3858347 2025-12-26  689009.SH          1.271761

[3610510 rows x 3 columns]

## A191 Factor 162

Formula:

`(SMA(MAX(CLOSE-DELAY(CLOSE,1),0),12,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),12,1)*100-MIN(SMA(MAX(CLOSE-DELAY(CLOSE,1),0),12,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),12,1)*100,12))/(MAX(SMA(MAX(CLOSE-DELAY(CLOSE,1),0),12,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),12,1)*100,12)-MIN(SMA(MAX(CLOSE-DELAY(CLOSE,1),0),12,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),12,1)*100,12))`

In [6]:
sql_alpha_162 = f"""--sql
SELECT
    date,
    instrument,
    (m_ta_ewm(greatest(close - m_lag(close, 1), 0), 12, 1) /
     m_ta_ewm(abs(close - m_lag(close, 1)), 12, 1) * 100 -
     m_min(m_ta_ewm(greatest(close - m_lag(close, 1), 0), 12, 1) /
           m_ta_ewm(abs(close - m_lag(close, 1)), 12, 1) * 100, 12)) /
    (m_max(m_ta_ewm(greatest(close - m_lag(close, 1), 0), 12, 1) /
           m_ta_ewm(abs(close - m_lag(close, 1)), 12, 1) * 100, 12) -
     m_min(m_ta_ewm(greatest(close - m_lag(close, 1), 0), 12, 1) /
           m_ta_ewm(abs(close - m_lag(close, 1)), 12, 1) * 100, 12))
    AS alpha_a191_f0162
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_162), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0162
65895   2023-01-20  000001.SZ          1.000000
65896   2023-01-20  000002.SZ          1.000000
65897   2023-01-20  000004.SZ          1.000000
65898   2023-01-20  000005.SZ          1.000000
65899   2023-01-20  000006.SZ          1.000000
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.338108
3858341 2025-12-26  688800.SH          0.827842
3858345 2025-12-26  688819.SH          0.843415
3858346 2025-12-26  688981.SH          0.861613
3858347 2025-12-26  689009.SH          0.096307

[3604932 rows x 3 columns]

## A191 Factor 163

Formula:

`RANK(((((-1 * RET) * MEAN(VOLUME,20)) * VWAP) * (HIGH -CLOSE)))`

In [7]:
sql_alpha_163 = f"""--sql
SELECT
    date,
    instrument,
    c_pct_rank(((((-1 * ret) * m_avg(volume, 20)) * vwap) * (high - close)))
    AS alpha_a191_f0163
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_163), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0163
101438  2023-02-07  000001.SZ          0.001846
101439  2023-02-07  000002.SZ          0.000615
101440  2023-02-07  000004.SZ          0.292103
101441  2023-02-07  000005.SZ          0.646667
101442  2023-02-07  000006.SZ          0.059487
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.843392
3858341 2025-12-26  688800.SH          0.982534
3858345 2025-12-26  688819.SH          0.194062
3858346 2025-12-26  688981.SH          0.977877
3858347 2025-12-26  689009.SH          0.949350

[3568164 rows x 3 columns]

## A191 Factor 164

Formula:

`SMA((((CLOSE>DELAY(CLOSE,1))?1/(CLOSE-DELAY(CLOSE,1)):1)-MIN(((CLOSE>DELAY(CLOSE,1))?1/(CLOSE-DELAY(CLOSE,1)):1),12))/(HIGH-LOW)*100,13,2)`

In [8]:
sql_alpha_164 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(
        (IF(close > m_lag(close, 1),
            1 / (close - m_lag(close, 1)),
            1) -
         m_min(IF(close > m_lag(close, 1),
                  1 / (close - m_lag(close, 1)),
                  1), 12)) /
        (high - low) * 100,
        13,
        2
    )
    AS alpha_a191_f0164
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_164), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0164
60821   2023-01-19  000001.SZ          2.237296
60822   2023-01-19  000002.SZ          0.077671
60823   2023-01-19  000004.SZ        387.551925
60824   2023-01-19  000005.SZ          0.000000
60825   2023-01-19  000006.SZ          9.608253
...            ...        ...               ...
3858340 2025-12-26  688799.SH        564.789507
3858341 2025-12-26  688800.SH         11.096356
3858345 2025-12-26  688819.SH        365.882755
3858346 2025-12-26  688981.SH         19.418993
3858347 2025-12-26  689009.SH        332.266955

[3602651 rows x 3 columns]

## A191 Factor 165

Formula:

`MAX(SUMAC(CLOSE-MEAN(CLOSE,48)))-MIN(SUMAC(CLOSE-MEAN(CLOSE,48)))/STD(CLOSE,48)`

In [9]:
sql_alpha_165 = f"""--sql
SELECT
    date,
    instrument,
    m_max(c_sum(close - m_avg(close, 48)), 48) -
    m_min(c_sum(close - m_avg(close, 48)), 48) /
    m_stddev(close, 48)
    AS alpha_a191_f0165
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_165), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0165
486500  2023-05-29  000001.SZ      10944.130882
486501  2023-05-29  000002.SZ      10670.440417
486502  2023-05-29  000004.SZ      15182.272857
486503  2023-05-29  000005.SZ      19027.310809
486504  2023-05-29  000006.SZ      12121.807418
...            ...        ...               ...
3858340 2025-12-26  688799.SH      48691.193884
3858341 2025-12-26  688800.SH      39313.253397
3858345 2025-12-26  688819.SH      54853.444065
3858346 2025-12-26  688981.SH      41271.396381
3858347 2025-12-26  689009.SH      49056.333653

[3189791 rows x 3 columns]

## A191 Factor 166

Formula:

`-20*(20-1)^1.5*SUM(CLOSE/DELAY(CLOSE,1)-1-MEAN(CLOSE/DELAY(CLOSE,1)-1,20),20)/((20-1)*(20-2)*(SUM((CLOSE/DELAY(CLOSE,1)-1)^2,20))^1.5)`

In [10]:
sql_alpha_166 = f"""--sql
SELECT
    date,
    instrument,
    -20 * ((20 - 1) ^ 1.5 *
           m_sum(close / m_lag(close, 1) - 1 -
                 m_avg(close / m_lag(close, 1) - 1, 20), 20)) /
    ((20 - 1) * (20 - 2) *
     (m_sum(m_avg(close / m_lag(close, 1), 20) ^ 2, 20)) ^ 1.5)
    AS alpha_a191_f0166
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_166), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0166
203309  2023-03-07  000001.SZ         -0.001004
203310  2023-03-07  000002.SZ          0.000802
203311  2023-03-07  000004.SZ          0.003850
203312  2023-03-07  000005.SZ         -0.000726
203313  2023-03-07  000006.SZ         -0.000019
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.000531
3858341 2025-12-26  688800.SH         -0.006374
3858345 2025-12-26  688819.SH         -0.004276
3858346 2025-12-26  688981.SH         -0.004650
3858347 2025-12-26  689009.SH          0.000881

[3462445 rows x 3 columns]

## A191 Factor 167

Formula:

`SUM((CLOSE-DELAY(CLOSE,1)>0?CLOSE-DELAY(CLOSE,1):0),12)`

In [11]:
sql_alpha_167 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close - m_lag(close, 1) > 0,
             close - m_lag(close, 1),
             0), 12)
    AS alpha_a191_f0167
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_167), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0167
60821   2023-01-19  000001.SZ        143.559625
60822   2023-01-19  000002.SZ        131.346255
60823   2023-01-19  000004.SZ          2.885342
60824   2023-01-19  000005.SZ          1.668169
60825   2023-01-19  000006.SZ          1.946977
...            ...        ...               ...
3858340 2025-12-26  688799.SH          7.610985
3858341 2025-12-26  688800.SH         28.963549
3858345 2025-12-26  688819.SH          3.958552
3858346 2025-12-26  688981.SH         16.940000
3858347 2025-12-26  689009.SH          3.792033

[3610510 rows x 3 columns]

## A191 Factor 168

Formula:

`(-1*VOLUME/MEAN(VOLUME,20))`

In [12]:
sql_alpha_168 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * volume / m_avg(volume, 20))
    AS alpha_a191_f0168
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_168), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0168
101438  2023-02-07  000001.SZ         -0.745753
101439  2023-02-07  000002.SZ         -1.397485
101440  2023-02-07  000004.SZ         -1.544800
101441  2023-02-07  000005.SZ         -0.782265
101442  2023-02-07  000006.SZ         -0.688050
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -1.118530
3858341 2025-12-26  688800.SH         -1.206388
3858345 2025-12-26  688819.SH         -1.087637
3858346 2025-12-26  688981.SH         -1.002351
3858347 2025-12-26  689009.SH         -1.615984

[3568164 rows x 3 columns]

## A191 Factor 169

Formula:

`SMA(MEAN(DELAY(SMA(CLOSE-DELAY(CLOSE,1),9,1),1),12)-MEAN(DELAY(SMA(CLOSE-DELAY(CLOSE,1),9,1),1),26),10,1)`

In [13]:
sql_alpha_169 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(
        m_avg(m_lag(m_ta_ewm(close - m_lag(close, 1), 9, 1), 1), 12) -
        m_avg(m_lag(m_ta_ewm(close - m_lag(close, 1), 9, 1), 1), 26),
        10,
        1
    )
    AS alpha_a191_f0169
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_169), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0169
142120  2023-02-17  000001.SZ         -9.168187
142121  2023-02-17  000002.SZ        -12.528456
142122  2023-02-17  000004.SZ          0.137814
142123  2023-02-17  000005.SZ         -0.089251
142124  2023-02-17  000006.SZ          2.469127
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.088463
3858341 2025-12-26  688800.SH          0.501026
3858345 2025-12-26  688819.SH          0.001688
3858346 2025-12-26  688981.SH          0.133711
3858347 2025-12-26  689009.SH          0.083540

[3525855 rows x 3 columns]

## A191 Factor 170

Formula:

`((((RANK((1 / CLOSE)) * VOLUME) / MEAN(VOLUME,20)) * ((HIGH * RANK((HIGH -CLOSE))) / (SUM(HIGH, 5) /5))) -RANK((VWAP -DELAY(VWAP, 5))))`

In [14]:
sql_alpha_170 = f"""--sql
SELECT
    date,
    instrument,
    ((((c_pct_rank((1 / close)) * volume) / m_avg(volume,20)) *
      ((high * c_pct_rank((high - close))) / (m_sum(high, 5) / 5))) -
     c_pct_rank((vwap - m_lag(vwap, 5))))
    AS alpha_a191_f0170
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_170), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0170
101438  2023-02-07  000001.SZ         -0.054752
101439  2023-02-07  000002.SZ         -0.076424
101440  2023-02-07  000004.SZ          0.182711
101441  2023-02-07  000005.SZ         -0.058785
101442  2023-02-07  000006.SZ         -0.129809
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.110796
3858341 2025-12-26  688800.SH         -0.841210
3858345 2025-12-26  688819.SH         -0.535614
3858346 2025-12-26  688981.SH         -0.838539
3858347 2025-12-26  689009.SH          0.334342

[3568164 rows x 3 columns]

## A191 Factor 171

Formula:

`((-1 * ((LOW -CLOSE) * (OPEN^5))) / ((CLOSE -HIGH) * (CLOSE^5)))`

In [15]:
sql_alpha_171 = f"""--sql
SELECT
    date,
    instrument,
    ((-1 * ((low - close) * (open ^ 5))) /
     ((close - high) * (close ^ 5)))
    AS alpha_a191_f0171
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_171), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0171
5067    2023-01-04  000001.SZ         -5.550362
5068    2023-01-04  000002.SZ         -3.822448
5069    2023-01-04  000004.SZ         -2.413375
5070    2023-01-04  000005.SZ         -0.973546
5071    2023-01-04  000006.SZ         -0.501901
...            ...        ...               ...
3858343 2025-12-26  688805.SH         -0.016667
3858344 2025-12-26  688807.SH         -0.059025
3858345 2025-12-26  688819.SH         -1.083019
3858346 2025-12-26  688981.SH         -0.356365
3858347 2025-12-26  689009.SH         -0.044104

[3513832 rows x 3 columns]

## A191 Factor 172

Formula:

`MEAN(ABS(SUM((LD>0 & LD>HD)?LD:0,14)*100/SUM(TR,14)-SUM((HD>0 &HD>LD)?HD:0,14)*100/SUM(TR,14))/(SUM((LD>0 & LD>HD)?LD:0,14)*100/SUM(TR,14)+SUM((HD>0 &HD>LD)?HD:0,14)*100/SUM(TR,14))*100,6)`

In [16]:
sql_alpha_172 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(
        abs(
            (m_sum(IF(LD > 0 AND LD > HD, LD, 0), 14) * 100 / m_sum(TR, 14) -
             m_sum(IF(HD > 0 AND HD > LD, HD, 0), 14) * 100 / m_sum(TR, 14)) /
            (m_sum(IF(LD > 0 AND LD > HD, LD, 0), 14) * 100 / m_sum(TR, 14) +
             m_sum(IF(HD > 0 AND HD > LD, HD, 0), 14) * 100 / m_sum(TR, 14))
        ) * 100,
        6
    )
    AS alpha_a191_f0172
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_172), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0172
96358   2023-02-06  000001.SZ         35.418449
96359   2023-02-06  000002.SZ         23.180324
96360   2023-02-06  000004.SZ         28.415271
96361   2023-02-06  000005.SZ         27.840843
96362   2023-02-06  000006.SZ         39.345505
...            ...        ...               ...
3858340 2025-12-26  688799.SH         35.896415
3858341 2025-12-26  688800.SH         23.965705
3858345 2025-12-26  688819.SH         30.432124
3858346 2025-12-26  688981.SH         27.964212
3858347 2025-12-26  689009.SH         13.720740

[3573454 rows x 3 columns]

## A191 Factor 173

Formula:

`3*SMA(CLOSE,13,2)-2*SMA(SMA(CLOSE,13,2),13,2)+SMA(SMA(SMA(LOG(CLOSE),13,2),13,2),13,2)`

In [17]:
sql_alpha_173 = f"""--sql
SELECT
    date,
    instrument,
    3*m_ta_ewm(close,13,2) -
    2*m_ta_ewm(m_ta_ewm(close,13,2),13,2) +
    m_ta_ewm(m_ta_ewm(m_ta_ewm(log(close),13,2),13,2),13,2)
    AS alpha_a191_f0173
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_173), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0173
5067    2023-01-04  000001.SZ       1634.779141
5068    2023-01-04  000002.SZ       3299.272024
5069    2023-01-04  000004.SZ         42.083262
5070    2023-01-04  000005.SZ         18.569226
5071    2023-01-04  000006.SZ        242.247590
...            ...        ...               ...
3858343 2025-12-26  688805.SH         54.017799
3858344 2025-12-26  688807.SH        212.594856
3858345 2025-12-26  688819.SH         38.498108
3858346 2025-12-26  688981.SH        125.360496
3858347 2025-12-26  689009.SH         61.941757

[3668803 rows x 3 columns]

## A191 Factor 174

Formula:

`SMA((CLOSE>DELAY(CLOSE,1)?STD(CLOSE,20):0),20,1)`

In [18]:
sql_alpha_174 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(IF(close > m_lag(close, 1), m_stddev(close, 20), 0), 20, 1)
    AS alpha_a191_f0174
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_174), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0174
5067    2023-01-04  000001.SZ          0.000000
5068    2023-01-04  000002.SZ          0.000000
5069    2023-01-04  000004.SZ          0.000000
5070    2023-01-04  000005.SZ          0.000000
5071    2023-01-04  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.000000
3858344 2025-12-26  688807.SH          0.000000
3858345 2025-12-26  688819.SH          0.573979
3858346 2025-12-26  688981.SH          1.676841
3858347 2025-12-26  689009.SH          0.848210

[3617945 rows x 3 columns]

## A191 Factor 175

Formula:

`MEAN(MAX(MAX((HIGH-LOW),ABS(DELAY(CLOSE,1)-HIGH)),ABS(DELAY(CLOSE,1)-LOW)),6)`

In [19]:
sql_alpha_175 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(greatest(greatest((high-low),
                             abs(m_lag(close,1)-high)),
                  abs(m_lag(close,1)-low)),6)
    AS alpha_a191_f0175
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_175), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0175
30405   2023-01-11  000001.SZ         51.271295
30406   2023-01-11  000002.SZ        114.639934
30407   2023-01-11  000004.SZ          0.853411
30408   2023-01-11  000005.SZ          0.447934
30409   2023-01-11  000006.SZ          9.540189
...            ...        ...               ...
3858341 2025-12-26  688800.SH          9.487526
3858342 2025-12-26  688802.SH         54.755000
3858345 2025-12-26  688819.SH          0.623308
3858346 2025-12-26  688981.SH          4.081667
3858347 2025-12-26  689009.SH          1.388001

[3642292 rows x 3 columns]

## A191 Factor 176

Formula:

`CORR(RANK(((CLOSE -TSMIN(LOW, 12)) / (TSMAX(HIGH, 12) -TSMIN(LOW,12)))),RANK(VOLUME), 6)`

In [20]:
sql_alpha_176 = f"""--sql
SELECT
    date,
    instrument,
    m_corr(
        c_pct_rank(((close - m_min(low, 12)) /
                    (m_max(high, 12) - m_min(low,12)))),
        c_pct_rank(volume),
        6
    )
    AS alpha_a191_f0176
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_176), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0176
86200   2023-02-02  000001.SZ         -0.879444
86201   2023-02-02  000002.SZ         -0.012575
86202   2023-02-02  000004.SZ         -0.719287
86203   2023-02-02  000005.SZ         -0.586375
86204   2023-02-02  000006.SZ         -0.239873
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.643144
3858341 2025-12-26  688800.SH          0.936528
3858345 2025-12-26  688819.SH          0.284761
3858346 2025-12-26  688981.SH          0.929830
3858347 2025-12-26  689009.SH         -0.677474

[3583973 rows x 3 columns]

## A191 Factor 177

Formula:

`((20-HIGHDAY(HIGH,20))/20)*100`

In [21]:
sql_alpha_177 = f"""--sql
SELECT
    date,
    instrument,
    ((20 - m_imax(high,20)) / 20) * 100
    AS alpha_a191_f0177
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_177), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0177
101438  2023-02-07  000001.SZ              35.0
101439  2023-02-07  000002.SZ              90.0
101440  2023-02-07  000004.SZ              30.0
101441  2023-02-07  000005.SZ              95.0
101442  2023-02-07  000006.SZ             100.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH              20.0
3858341 2025-12-26  688800.SH              10.0
3858345 2025-12-26  688819.SH              50.0
3858346 2025-12-26  688981.SH              10.0
3858347 2025-12-26  689009.SH              85.0

[3568164 rows x 3 columns]

## A191 Factor 178

Formula:

`(CLOSE-DELAY(CLOSE,1))/DELAY(CLOSE,1)*VOLUME`

In [22]:
sql_alpha_178 = f"""--sql
SELECT
    date,
    instrument,
    (close - m_lag(close,1)) / m_lag(close,1) * volume
    AS alpha_a191_f0178
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_178), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0178
10134   2023-01-05  000001.SZ      1.860810e+06
10135   2023-01-05  000002.SZ      9.615299e+05
10136   2023-01-05  000004.SZ     -1.061677e+04
10137   2023-01-05  000005.SZ      2.049176e+05
10138   2023-01-05  000006.SZ     -4.430989e+06
...            ...        ...               ...
3858343 2025-12-26  688805.SH     -4.717364e+05
3858344 2025-12-26  688807.SH     -4.605193e+05
3858345 2025-12-26  688819.SH      4.082715e+04
3858346 2025-12-26  688981.SH     -3.204014e+05
3858347 2025-12-26  689009.SH     -3.666854e+05

[3663499 rows x 3 columns]

## A191 Factor 179

Formula:

`(RANK(CORR(VWAP, VOLUME, 4)) *RANK(CORR(RANK(LOW),RANK(MEAN(VOLUME,50)), 12)))`

In [23]:
sql_alpha_179 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(vwap, volume, 4)) *
     c_pct_rank(m_corr(c_pct_rank(low),
                        c_pct_rank(m_avg(volume,50)), 12)))
    AS alpha_a191_f0179
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_179), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0179
310874  2023-04-06  000001.SZ          0.604244
310875  2023-04-06  000002.SZ          0.283219
310876  2023-04-06  000004.SZ          0.135408
310877  2023-04-06  000005.SZ          0.035267
310878  2023-04-06  000006.SZ          0.472165
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.215401
3858341 2025-12-26  688800.SH          0.328418
3858345 2025-12-26  688819.SH          0.202147
3858346 2025-12-26  688981.SH          0.021250
3858347 2025-12-26  689009.SH          0.000685

[3351661 rows x 3 columns]

## A191 Factor 180

Formula:

`((MEAN(VOLUME,20) < VOLUME) ? ((-1 * TSRANK(ABS(DELTA(CLOSE, 7)), 60)) *SIGN(DELTA(CLOSE, 7)) : (-1 *VOLUME)))`

In [24]:
sql_alpha_180 = f"""--sql
SELECT
    date,
    instrument,
    IF(m_avg(volume, 20) < volume,
       (-1 * m_rank(abs(m_delta(close, 7)), 60)) * sign(m_delta(close, 7)),
       -1 * volume)
    AS alpha_a191_f0180
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_180), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0180
5067    2023-01-04  000001.SZ      -218968253.0
5068    2023-01-04  000002.SZ      -108714691.0
5069    2023-01-04  000004.SZ        -1637562.0
5070    2023-01-04  000005.SZ        -4557470.0
5071    2023-01-04  000006.SZ      -137525050.0
...            ...        ...               ...
3858343 2025-12-26  688805.SH       -10222873.0
3858344 2025-12-26  688807.SH        -5280134.0
3858345 2025-12-26  688819.SH             -16.0
3858346 2025-12-26  688981.SH             -45.0
3858347 2025-12-26  689009.SH               7.0

[3575040 rows x 3 columns]